Tekla Open API Reference for Tekla Structures 2025
AnalysisPartAnalysisProperties.AnalysisClassEnum Enumeration
 The analysis classes.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AnalysisClassEnum
Public Enumeration AnalysisClassEnum
Members
Member name | Value | Description
ANALYSIS_CLASS_COLUMN | 1 |  The column analysis class.
ANALYSIS_CLASS_BEAM | 2 |  The beam analysis class.
ANALYSIS_CLASS_WALL | 3 |  The wall analysis class.
ANALYSIS_CLASS_SLAB | 4 |  The slab analysis class.
ANALYSIS_CLASS_CONTOUR_PLATE | 5 |  The contour plate analysis class.
ANALYSIS_CLASS_SECONDARY | 99 |  The old secondary object analysis class. Named now as bracing.
ANALYSIS_CLASS_BRACING | 99 |  The bracing object analysis class.
ANALYSIS_CLASS_SECONDARY_MEMBER | 100 |  The secondary object analysis class.
See Also
Reference
Tekla.Structures.Analysis Namespace